#### `terraform plan` Success
<details><summary>Show Output</summary>

```
    + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.content.kubernetes_role.prefect_agent will be created
  + resource "kubernetes_role" "prefect_agent" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "prefect-agent-rbac"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "batch",
              + "extensions",
            ]
          + resources  = [
              + "jobs",
            ]
          + verbs      = [
              + "*",
            ]
        }
      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "events",
              + "pods",
            ]
          + verbs      = [
              + "*",
            ]
        }
    }

  # module.infrastructure.module.content.kubernetes_role_binding.prefect_agent will be created
  + resource "kubernetes_role_binding" "prefect_agent" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "prefect-agent-rbac"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "prefect-agent-rbac"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "prefect-agent"
          + namespace = "default"
        }
    }

  # module.infrastructure.module.content.kubernetes_secret.spark_config will be created
  + resource "kubernetes_secret" "spark_config" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "spark-config"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.content.kubernetes_service_account.prefect_agent will be created
  + resource "kubernetes_service_account" "prefect_agent" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "prefect-agent"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + secret {
          + name = "prefect-auth"
        }
    }

  # module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch will be destroyed
  - resource "aws_iam_access_key" "elasticsearch" {
      - create_date          = "2021-05-22T07:52:54Z" -> null
      - id                   = "AKIASM4ZEOVSI6VLF73T" -> null
      - secret               = (sensitive value)
      - ses_smtp_password_v4 = (sensitive value)
      - status               = "Active" -> null
      - user                 = "elasticsearch" -> null
    }

  # module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup will be destroyed
  - resource "aws_iam_policy" "elasticsearch_backup" {
      - arn         = "arn:aws:iam::165140526436:policy/elasticsearch-backup-role" -> null
      - description = "IAM policy to let elasticsearch backup documents to S3" -> null
      - id          = "arn:aws:iam::165140526436:policy/elasticsearch-backup-role" -> null
      - name        = "elasticsearch-backup-role" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucketVersions",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::fluentlabs-elasticsearch-backups"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListMultipartUploadParts",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::fluentlabs-elasticsearch-backups/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPASM4ZEOVSE6Z67KVAZ" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup will be destroyed
  - resource "aws_iam_policy_attachment" "elasticsearch_backup" {
      - groups     = [] -> null
      - id         = "elasticsearch-backup-role-attach" -> null
      - name       = "elasticsearch-backup-role-attach" -> null
      - policy_arn = "arn:aws:iam::165140526436:policy/elasticsearch-backup-role" -> null
      - roles      = [] -> null
      - users      = [
          - "elasticsearch",
        ] -> null
    }

  # module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch will be destroyed
  - resource "aws_iam_user" "elasticsearch" {
      - arn           = "arn:aws:iam::165140526436:user/elasticsearch" -> null
      - force_destroy = false -> null
      - id            = "elasticsearch" -> null
      - name          = "elasticsearch" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDASM4ZEOVSFQHCLTWYV" -> null
    }

  # module.infrastructure.module.elasticsearch.aws_s3_bucket.backup will be destroyed
  - resource "aws_s3_bucket" "backup" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::fluentlabs-elasticsearch-backups" -> null
      - bucket                      = "fluentlabs-elasticsearch-backups" -> null
      - bucket_domain_name          = "fluentlabs-elasticsearch-backups.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "fluentlabs-elasticsearch-backups.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "fluentlabs-elasticsearch-backups" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service will be created
  + resource "kubernetes_deployment" "language_service" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = (known after apply)
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "language-service"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "language-service"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "lkjaero/language-service:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "language-service"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "ENVIRONMENT"
                          + value = "default"
                        }

                      + liveness_probe {
                          + failure_threshold     = 5
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/health"
                              + port   = "8000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8000
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 5
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/health"
                              + port   = "8000"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "memory" = "2000Mi"
                            }
                          + requests = {
                              + "memory" = "1400Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = "regcred"
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "language_service_autoscale" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_service.language_service will be created
  + resource "kubernetes_service" "language_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "language-service"
            }
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "language-service"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + name        = "language-service"
              + node_port   = (known after apply)
              + port        = 8000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch will be created
  + resource "helm_release" "fluentd_elasticsearch" {
      + atomic                     = false
      + chart                      = "fluentd-elasticsearch"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fluentd"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kokuwaio.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  hosts: 
                    - elastic-es-http.default.svc.cluster.local
                  scheme: https
                  sslVerify: false
            EOT,
        ]
      + verify                     = false
      + version                    = "11.6.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          + name  = "elasticsearch.auth.password"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.monitoring.helm_release.prometheus_operator will be created
  + resource "helm_release" "prometheus_operator" {
      + atomic                     = false
      + chart                      = "kube-prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.3.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.monitoring.helm_release.sematext_logagent will be created
  + resource "helm_release" "sematext_logagent" {
      + atomic                     = false
      + chart                      = "sematext-agent"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sematext"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://cdn.sematext.com/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.0.35"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "region"
          + value = "US"
        }

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      ~ id     = "default/nginx-ingress-nginx-ingress" -> (known after apply)
      ~ spec   = [
          - {
              - cluster_ip                  = "10.245.179.1"
              - external_ips                = []
              - external_name               = ""
              - external_traffic_policy     = "Local"
              - health_check_node_port      = 30696
              - load_balancer_ip            = ""
              - load_balancer_source_ranges = []
              - port                        = [
                  - {
                      - name        = "http"
                      - node_port   = 32728
                      - port        = 80
                      - protocol    = "TCP"
                      - target_port = "80"
                    },
                  - {
                      - name        = "https"
                      - node_port   = 30763
                      - port        = 443
                      - protocol    = "TCP"
                      - target_port = "443"
                    },
                ]
              - publish_not_ready_addresses = false
              - selector                    = {
                  - "app" = "nginx-ingress-nginx-ingress"
                }
              - session_affinity            = "None"
              - type                        = "LoadBalancer"
            },
        ] -> (known after apply)
      ~ status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "159.89.223.61"
                            },
                        ]
                    },
                ]
            },
        ] -> (known after apply)

      ~ metadata {
          - annotations      = {
              - "kubernetes.digitalocean.com/load-balancer-id" = "fd4753a2-359a-40d6-b9df-682beb1a1877"
              - "meta.helm.sh/release-name"                    = "nginx-ingress"
              - "meta.helm.sh/release-namespace"               = "default"
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {
              - "helm.sh/chart" = "nginx-ingress-0.7.1"
            } -> null
            name             = "nginx-ingress-nginx-ingress"
          ~ resource_version = "2358536" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "e0715062-0c45-4276-b6b8-5ee11c0d4d35" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.nginx.com/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                  enableCustomResources: true
                  enableTLSPassthrough: true
            EOT,
        ]
      + verify                     = false
      + version                    = "0.7.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress will be created
  + resource "kubernetes_ingress" "ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "fluentlabs-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.fluentlabs.io"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "9000"
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "api.fluentlabs.io",
                ]
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 21 to add, 0 to change, 5 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
